Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/F26.tmx
Source language: en_us
Languages: zh_cn

source: 5 reasons why I am vegan and other
zh_cn: 我选择当素食主义者的原因

source: I have been doing a lot of summer press lately for my book 365 Vegan Smoothies, chatting with many non-vegan journalists and bloggers about my lifestyle.
zh_cn: 最近我举行了很多场新闻发布会来宣传我的书《365天素食》，和很多非素食主义者的记者和博客谈论我的生活方式。

source: And it always surprises me how every single one of them ask that one question every vegan hears again and again,
zh_cn: 让我感到很惊奇的是他们每一个人都不停地问同一个问题，似乎每个素食主义者都会被问到这个问题。

source: "So, why are you vegan?" or "What inspired you to try veganism?" or "Why vegan?"
zh_cn: “为什么你要当素食主义者呢？”或者是”是什么让你有尝试素食的冲动呢？“或者是”为什么要素食？”

source: As a vegan for about 13 years now, and a vegetarian on and off since my teen years, I am surprisingly still caught off guard by this question.
zh_cn: 迄今，作为一个素食主义者已经有13年了，而且从我青少年时期开始，对于素食我是断断续续的，坚持过一段时期然后又放弃过， 但是到现在对于这个问题我仍然是措手不及。

source: I never seem to answer it exactly the same, and I never have a "speech" ready as I know many of my vegan friends do.
zh_cn: 似乎对于这个问题我从来没有完全一模一样的回答它， 我也没有像我其他很多素食主义朋友那样准备好“演讲稿”。

source: You would think that by now I would have some set in stone response, a tried-and-true answer for everyone who asks.
zh_cn: 你可能会认为现在我应该有了固定的答案了，一个真诚可靠的答案。

source: But I always find myself stumbling a bit as the questioner awaits a long, detailed and lengthy response.
zh_cn: 但是我觉得自己老是会被这个问题难住，因为这个问题总需要一个详细而又冗长的回答。

source: But the reasons, once I gather my thoughts are really quite simple.
zh_cn: 但是对于为什么素食的原因，如果一旦我理清我的思绪了的话，就会变得很清晰了。

source: It always goes like this. When I respond to the "Why vegan?" question.. I usually start off by saying one simple thing like, "Well ever since I was little I have had an intense love for animals."
zh_cn: 当我回答“为什么要素食”这个问题时，我总是这样：以一个简单的事例开始，像是“ 从我小时候开始，我对动物就有一种强烈的爱”。

source: And I pause. The interviewer pauses, response-less, expecting me to continue.
zh_cn: 然后我就会中断，采访者也停下来，没有响应，期望我能继续说下去。

source: So I do continue for the sake of filling the void of dead air and silence.
zh_cn: 然后我为了避免沉默的气氛继续说下去。

source: I love animals. And do not wish to eat them.
zh_cn: 我爱那些动物，我不想去吃他们。

source: Simple, yes?
zh_cn: 这样很简单，对吧？

source: But yes I guess I could go on.
zh_cn: 但是我想我也是可以继续说下去的。

source: So to really detail ALL the main reasons why, here is my five point answer that I am happy to share today.
zh_cn: 对于我为什么素食的主要原因，如果要详细地说的话，今天我很开心能够跟大家分享以下5个点。

source: Discussion Ahead: Reasons why I am vegan, how I talk to kids about my vegan diet, and pets and veganism!..
zh_cn: 之前的谈论的一样： 我素食的原因， 我如何跟孩子们谈论有关我的素食饮食，宠物和素食主义的！。。。

source: 5 Reasons Why I am Vegan
zh_cn: 我素食的五大原因

source: I Love Animals.
zh_cn: 1.我喜欢动物。

source: I have always had a very strong emotional bond with animals big and small ever since I was a child.
zh_cn: 从小时候开始我就对对于大大小小的动物都有一种十分强烈的情感联系。

source: I would adore the birds and raccoons and other California wildlife that would pop up in our backyard.
zh_cn: 我很喜欢小鸟，浣熊还有在我后院停留过的加利福利亚的所有野生动物。

source: I loved my pet kittens and bunny and bird and fish.
zh_cn: 我很爱我的宠物小猫，兔子，小鸟和鱼。

source: I loved everything about sweet, gentle animals.
zh_cn: 我喜欢所有一切可爱又温柔的动物。

source: That love has never faded.
zh_cn: 这种爱从来都没有减少过。

source: I light up like a shooting star when I come across animals in my day to day life. Dogs on the beach walks, birds chirping in the trees, dolphins jumping out of the sparkling Pacific ocean as they glide across the water, cats in windows and on YouTube videos, cows grazing in a pasture, tiny ladybugs and butterflies in a garden.
zh_cn: 在我平常的生活中一遇到这些动物的话，我会露出闪烁流星一样光芒的欣喜：在沙滩中溜达的小狗，在树上唧唧叫的小鸟，从水面划出，从闪烁的太平洋跳跃出来的海豚，在窗台和视频中的小猫，放牧在大草原的奶牛，在花园的小瓢虫和蝴蝶。

source: They have such pure and honest souls. They are on this Earth, placed in our care.
zh_cn: 他们都拥有着如此纯洁和真诚的灵魂啊！他们是在这地球上的生物，他们需要我们的关心。

source: Humans have the power to fight for animals or take advantage of their innocence and vulnerability.
zh_cn: 人类拥有为动物争取权利的力量，也可以利用它们的纯真和脆弱性。

source: They are like children in that way.
zh_cn: 在这方面它们就像孩子一般。

source: Even the strongest lion in Africa or shark in the ocean could be easily destroyed by a human.
zh_cn: 即使是在非洲最强壮的狮子或者是海洋中的大白鲨，它们都很容易被人类伤害。

source: Animals do not have voices and they do not have the same level of highly evolved intelligence that we have. (Though they do have strengths in ways we can only dream of.
zh_cn: 动物都没有说话的权利也没有我们进化得来的高智商。

source: Dolphins have sonar, cats can see in the dark and find their owners sometimes thousands of miles away, bears can hibernate, fish swim in majestic underwater worlds, cheetahs can run as fast as a speeding car, and birds can fly. Just to name a few.)
zh_cn: （尽管他们拥有一些我们梦寐以求的能力：海豚有声纳的能力，猫在黑暗中也能看到东西，有时候甚至可以找到离他们几千里远的主人，熊可以冬眠，鱼能够在广阔的海洋中遨游，猎豹能够跑得跟汽车一样快，小鸟能够飞，在这里只列举一些）

source: But still, animals are subject to the force or love of humans.
zh_cn: 但是，动物仍然是受人类力量或者爱的支配控制的。

source: And so it is up to the animal lovers of this planet to fight for them and speak up for them when their is need.
zh_cn: 当这些动物需要关爱的时候，这个星球上的动物爱好者能够为它们斗争为它们说话是十分重要的。

source: Look closely and it is easy to see that animals are similar to us on so many levels.
zh_cn: 仔细观察下，不难看出在很多方面我们与动物有很多相似的地方。

source: They can exhibit the same emotions we do, fear, love, sadness, joy.
zh_cn: 它们能够像我们一样表现情感，恐惧，爱，悲伤，喜悦。

source: They take care of their babies, find mates, make friends, play, build homes, travel and explore and feed themselves.
zh_cn: 它们会照看自己的孩子，寻找配偶，交朋友，玩耍，建立家庭，旅游，探索和自己觅食。

source: So the bottom line to the number one reason why I am vegan: I love animals and I do not have any desire to eat something with a life of its own to live.
zh_cn: 所以归根到底，我素食的第一个原因就是：我喜欢动物，我不愿意去吃有生命的东西。

source: And with this answer, I feel justified.
zh_cn: 这个答案，我认为是十分足够的了。

source: But yes there are more answers waiting in the wings..
zh_cn: 但是当然，还有更多的理由。

source: The Horror I Have Seen.
zh_cn: 2我所看到的让我惊骇的事情。

source: I find that many vegans, like myself, have done their research either by chance and accident or on purpose.
zh_cn: 我发现很多素食主义者，像我自己，都偶然或特意地自己做过研究。

source: Many have watched those horror-filled undercover investigation videos that are promoted via organizations like PETA, Farm Sanctuary, COK and many more.
zh_cn: 我们素食主义者都看过那些令人惊骇的调查视频，那些视频是由一些组织如善对动物组织、农场动物避难所，COK等等发放的。

source: If your eyes have seen what goes on behind the scenes of a slaughterhouse, a place where animal product production takes place you will most likely not want any part in those practices.
zh_cn: 如果你亲眼看到这些屠宰场--一个动物肉类加工场地血腥画面的背后，很有可能你不会想要参与其中。

source: You would likely not want to participate in the pain and horror that can be found.
zh_cn: 很可能你不会想要参与到这种痛苦和惊骇之中。

source: "But those are extreme examples." Non-vegans might say.
zh_cn: 非素食主义者可能会说：“但是那只是极端的例子而已。”

source: Well yes, the pain experienced by animals is on varying levels, and those who eat "compassionate or local meat, dairy and eggs" may claim the animals have "good lives and one bad day."
zh_cn: 对，动物所承受的痛苦是分程度的，而那些吃当地肉类，奶制品，蛋的人可能声称动物“有好的生活也会有要死去的一天”。

source: But I personally think that those types of statements are pointless.
zh_cn: 但是我个人认为这种陈述是毫无意义的。

source: The bottom line is that animals are being bought, sold, born and killed for the point of making animal products.
zh_cn: 底线就是这些动物将会被买被卖被杀，它们出生也是为了去制作这些动物制品。

source: Animal products that do not have the need they did in decades past, since there are so many alternatives available in today's world.
zh_cn: 我们不再像过去几十年那样需要这些动物制品，因为现在有如此多的替代品。

source: Synthetic wool and leather, plant-based foods, veganism is an option for humans, it just takes the desire to want to do it.
zh_cn: 人造羊毛和皮革，植物性食物，素食是人类的另一个选择，只是你是否想要这样子做罢了。

source: I believe that there is no such thing as "humane slaughter."
zh_cn: 我相信没有所谓的“人类屠杀”。

source: Could you imagine the horror on that one day of your animal life?
zh_cn: 你能够想象到有一天作为动物的那一种恐惧吗？

source: To end your life in such a sad way?
zh_cn: 就这样悲催的结束了一生？

source: I do not want to dwell too much on this reason, simply because you have to go out there and watch a few videos, read the latest animal cruelty reports, watch the horror stories unfold.
zh_cn: 我不想过多的解释这个原因，很简单，因为这需要你走出去，看一些视频，读读最新虐待动物的报告，看看那些被揭露的令人惊骇的故事。

source: As Paul McCartney famously says, "If slaughterhouses had glass walls, everyone would be vegetarian."
zh_cn: 保罗·麦卡特尼有一句很著名的话：“如果屠宰场有玻璃墙的话，那么所有人都会变成素食主义者。”

source: Doing your own research, watching videos, reading books, will hopefully inspire the desire in you to be curious about a plant-based, animal product free way of life.
zh_cn: 你可以自己做研究，看视频，读书，这样子很有希望地，你会想要去过一种素食，没有动物制品形式的生活。

source: Nowadays I try very hard NOT to watch those videos because it hurts my heart too much, but just yesterday I came across a video from a lobster factory that made me want to cry.
zh_cn: 现在我努力让自己不要去看这些视频，因为它们太伤我的心了。但是昨天我无意中看到了一个来自于龙虾工场的视频，那让我伤心得想要哭。

source: It was horrible.
zh_cn: 那实在太吓人了。

source: The cases of cruelty never end.
zh_cn: 凶残的事件从来都没有停止过。

source: New ones are always popping up.
zh_cn: 总会有新的不断发生。

source: The only way to end them is to end or at least dramatically reduce our dependence on animal products.
zh_cn: 唯一能结束这些残忍的事情只有一个办法，就是结束或者至少最大程度地减少我们对动物制品的依赖。

source: It is possible!
zh_cn: 这是有可能的！

source: Be inspired, and take it one step at a time until one day you turn into someone like me. A person who is so thrilled with their vegan diet and truly thinks that ANYONE would fall in love with it too if they give it a chance.
zh_cn: 受到鼓舞，然后一步一步采取行动直到有一天你会变成我一样的素食主义者：一个很热衷于素食饮食，而且真诚地认为只要人们愿意给素食一个机会的话，那么每个人都会爱上它的人。

source: Health.
zh_cn: 3.健康。

source: Yes yes yes. This too.
zh_cn: 是的，是的，也有这一个原因。

source: Health. Wellness. Nutrition.
zh_cn: 健康和营养。

source: I love the health benefits of being vegan.
zh_cn: 我爱死素食所能带来的养生价值了。

source: I naturally fill my day with healthy foods like veggies, fruit, nuts, seeds, whole grains and legumes.
zh_cn: 我的一天都是由蔬菜，水果，坚果，种子性食物，全谷类和豆类食物所填满。

source: I try to eat a healthy vegan diet by monitoring what I eat, making sure I consume enough nutrients like vitamin D, iron and B12.
zh_cn: 我希望通过控制吃什么来吃上一顿健康的素食餐，以确保我能够吸收到足够的营养，像是维生素D，铁和B12。

source: I supplement when needed and never feel like I am missing out on anything nowadays.
zh_cn: 我补充我所需要的营养，现在我从来没有觉得自己错过了任何东西。

source: It pays off to learn a bit about vegan nutrition and plan your diet accordingly.
zh_cn: 学习一下有关素食营养以及相应地计划自己的饮食中，你会得到回报的。

source: I find that I naturally keep my weight in a healthy range and I never feel the need to "diet."
zh_cn: 我发现我能够把我的体重保持在一个健康的范围内，而且我从来都不觉得我需要去“节食”。

source: In fact I pretty much eat anything that is vegan.
zh_cn: 事实上，我所吃的所有任何东西都是素的。

source: My diet is only about portion control, rather than strict rules on what I can and cannot eat.
zh_cn: 我的饮食只是与数量控制有关，而不是对于我能吃什么和不能吃什么的严格规定。

source: That may sound silly to outsiders, but seriously, there are so many foods that are vegan that I never ever feel deprived.
zh_cn: 对于外人来说，这可能看起来会有一点愚蠢，但是，我是认真的，有如此多素食性食物我从来都不觉得自己是缺少食物的。

source: It takes time, but in a few years you might even forget that you are vegan when ordering food and grocery shopping.
zh_cn: 这需要时间，但是几年后当你在点单或者在商店购物时，可能会忘了你是一个素食主义者。

source: This is the free-est way of eating I have ever experienced: I eat anything! As long as it contains no animal products.
zh_cn: 这是我体验过的最自由的吃法：我什么都吃！只要它不含有动物制品。

source: Vegan is Delicious.
zh_cn: 4.素菜很美味。

source: My favorite foods are vegan.
zh_cn: 我最喜欢的食物是素菜。

source: I have always been in love with fruit, sweet potatoes, hearty whole grains, pasta, fresh bread, muffins, smoothies and more.
zh_cn: 我一直很爱吃水果，甜土豆，丰盛的全谷类食品，意大利面，新鲜面包，小松饼，冰沙还有其他很多很多的东西。

source: All these foods are easily or naturally vegan.
zh_cn: 所有的这些食物都是很易制作的或是天然的素菜。

source: And seriously guys, anything and everything is vegan nowadays!
zh_cn: 还有说真的伙伴们，现在任何所有的一切都是素菜。

source: And the vegan versions of foods are delicious!
zh_cn: 而且素菜十分得美味！

source: Dairy-free ice creams are delicious.
zh_cn: 不含乳制品的雪糕很美味。

source: Coconut and cashew based ice creams are dreamy!
zh_cn: 以椰子和腰果制作的雪糕是我最梦寐以求的！

source: Vegan cheeses have gone gourmet and amazing.
zh_cn: 纯素起司是一道美食，好吃得让人惊喜。

source: There is even very realistic versions of mayo, beef, chicken and more.
zh_cn: 而且现实中还有蛋黄酱，牛肉，鸡肉其他很多的版本。

source: It is crazy how easy it is to be vegan in today's world .... even if you ARE a meat lover. Dive into those fake meat products.
zh_cn: 在今天，成为素食主义者是多么的简单啊，即使你是一个十分喜欢吃肉的人，都会沉浸于这些假的肉类产品中。

source: Eat at Veggie Grill if you visit LA!
zh_cn: 如果你去洛杉矶游玩的话，一定要去蔬菜烧烤店尝尝。

source: You will be forever changed!
zh_cn: 那可能会永远改变你哦！

source: And then over time, you may grow tired of "meat" version foods as your vegan diet evolves.
zh_cn: 到时候可能你会对肉类产生反感，因为你已经进化成为素食主义者了。

source: But those foods are super transition foods or foods for part- time / experimental vegans.
zh_cn: 这些食物对于那些只是偶尔吃素或者尝试去吃素的素食者来说是极好的过渡食物。

source: And for me, I love vegan products and brands like vegenaise, Beyond Meat and Field Roast. (And many more..)
zh_cn: 而对于我来说，我喜欢素食产品，像是维格奈斯，Beyond Meat ，Field Roast 这样的品牌（还有其他很多的品牌）

source: Plus with SO many vegan bloggers out there, basically any recipe you could dream of has a vegan version.
zh_cn: 加上有如此多素食博客，基本上你能想象到的所有食谱都有素食的版本。

source: Browse my site FindingVegan.com to find them.
zh_cn: 游览一下我的网站 FindinVegan.com找找这些食谱吧。

source: Vegan Makes My Heart Feel Good.
zh_cn: 5素菜能让我的心脏感觉很好。

source: Vegan is not a diet. It is a lifestyle.
zh_cn: 素食仅仅是膳食那么简单，它是一种生活方式。

source: You could simply go "plant-based" as a diet, which many celebrities and others have done in the past.
zh_cn: 你只需要简单地把植物性饮食作为你的日常饮食，很多名人和其他的人很早以前就这样做了。

source: But going vegan is something you do with your heart and not just your head.
zh_cn: 但是进行素食行动需要的不仅仅是你的头脑还有你的心。

source: Rolling your eyes yet?
zh_cn: 还在眨你的眼睛吗？

source: DON'T! Do not be afraid of having a compassionate heart!
zh_cn: 不要，不要害怕你去拥有一颗富有同情心的心！

source: Do not shy away from saying, geez I eat plants and save animals lives, I am a rockstar person!
zh_cn: 不要害羞去说，天啊，我吃植物，我解救动物，我是一位明星！

source: I feel so good knowing that my diet is in line with my values and ambitions to treat all living creatures and our planet with love, compassion and respect.
zh_cn: 我自我感觉很良好，因为我知道我的饮食跟我的价值观和目标是一致的：爱，同情和尊重一切有生命的生物和我们的地球。

source: More thoughts...
zh_cn: 更多的想法。。。

source: My Vegan Place in a Non-Vegan World.
zh_cn: 我是生活中非素食主义世界的素食主义者。

source: I look at my life as just one little person doing what they can for animals.
zh_cn: 我只把我自己看作是一个小人物，我希望尽量能为动物做一点事情。

source: Most of my family members and a large number of my best friends are not vegan.
zh_cn: 我的家人和很多朋友都不是素食主义者。

source: And I personally choose to respect that.
zh_cn: 当然我会去尊重他们。

source: It isn't even an issue when I dine out with them or interact with them.
zh_cn: 当我跟他们吃饭或者跟他们打交道的时候，那根本不成问题。

source: I do not think any progress is made when being negative or hateful or mean to those who do not live the same lifestyle as you do.
zh_cn: 我认为厌恶或憎恨那些跟你生活方式不一样的人是不会有任何的进展（帮助的）。

source: I respect their choices just as I hope they respect mine.
zh_cn: 我尊重他们的选择只是我也希望他们能够尊重我的选择。

source: And I find that by having a non-judgemental stance at the dining table, non-vegans feel more at ease in discussing my diet and asking questions they may have about plant-based foods with me.
zh_cn: 而且我发现如果你以一种非批判性的姿态看待餐桌上的食物时，那些非素食主义者会感觉更加地自在谈论我的饮食和问植物性饮食的问题。

source: Confidence is key.
zh_cn: 自信是关键。

source: Never feel ashamed or quiet about your vegan status.
zh_cn: 不要对你素食这件事感到羞愧或沉默。

source: Speak boldly but with love and truth, others will respect your conviction and hopefully come to respect your lifestyle as well.
zh_cn: 大胆但是包含爱和真诚地说，其他人会尊重你坚定的信仰的，而且也会尊重你的生活方式。

source: And maybe even become curious to try it themselves.
zh_cn: 而且可能会因为好奇而且试试。

source: Another key: compassion.
zh_cn: 另外一个关键：同情怜悯之心。

source: To humans too! Fact: no one likes a grumpy and hateful vegan.
zh_cn: 对待人也要这样！事实：没有人会喜欢一个脾气暴虐和可憎的素食主义者。

source: Even if your have seeing others ordering animal products and eating meat, just remember that they probably do not see their actions in the same light that you do.
zh_cn: 即使当你看到其他人正在点动物制品食物和在吃肉的时候，你要记住他们可能不会以你的观点那样看待这种行为。

source: And maybe even remember back to days when you too ate meat without a care!
zh_cn: 也要回想一下过去自己也毫不在意自己吃肉这件事。

source: Everyone can change.
zh_cn: 每个人都可以改变。

source: So give people a shot before turning into the grumpy angry vegan.
zh_cn: 所有在你要变为脾气暴虐和可憎的素食主义者之前，你要给别人一个机会。

source: You just do not want to be that person.
zh_cn: 你也不想变为那种可憎的人。

source: Use your passion and sensitivity to speak to people in a kind way.
zh_cn: 用你的热情和感情去以一种和善的方式与人交流。

source: Practice and learn the skill of speaking to people to gain their trust.
zh_cn: 练习和学习演说的技术去取得人们的信任。

source: I promise you will be able to speak deeper to them once they listen to what you have to say.
zh_cn: 我敢保证一旦他们听了你说的话，你会更加容易的跟他们更加深入的交谈下去。

source: Ears close right up when people are spoken to with anger or animosity.
zh_cn: 当人们和生气和充满仇恨的人讲话时，他们是听不进去任何话的。

source: The One Thing I do to Inspire Vegan-Thoughts in Others: FEED THEM.
zh_cn: 如何激励人们素食--以他们的观点出发：让他们吃。

source: I truly think delicious food speaks louder than words.
zh_cn: 我真真认为美味的食物比言语更有说服力。

source: I will say that again.
zh_cn: 我想要再说一遍。
